In [27]:
# Dowload the .db file and keep it locally

In [1]:
# !pip install ipython-sql prettytable (run this if not installed)

import prettytable
prettytable.DEFAULT = 'DEFAULT'

In [7]:
# run this if there is a version mismatch between some of the packages. Specifically, there's an issue with the typing_extensions module.

# !pip install --upgrade typing_extensions

Requirement already satisfied: typing_extensions in d:\softwares\anaconda\lib\site-packages (4.12.2)

In [2]:
# !pip install ipython-sql (run this if not installed)
%load_ext sql

In [3]:
# Connect to the SQLite Database First, use the %sql line magic to connect to your database
%sql sqlite:///D:/GitHub/nvidia-project/nvidia_database.db

## 2. See all the tables within the database

In [31]:
%%sql
-- Display all the tables in the database
SELECT *
FROM sqlite_master 
WHERE type='table'

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[('table', 'products', 'products', 2, 'CREATE TABLE products (\n    product_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    product_name TEXT NOT NULL,\n    category TEXT NOT NULL,\n    release_date DATE,\n    price REAL\n)'),
 ('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'customers', 'customers', 4, 'CREATE TABLE customers (\n    customer_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    customer_name TEXT NOT NULL,\n    industry TEXT,\n    contact_email TEXT,\n    contact_phone TEXT\n)'),
 ('table', 'sales', 'sales', 5, 'CREATE TABLE sales (\n    sale_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    product_id INTEGER,\n    customer_id INTEGER,\n    sale_date DATE,\n    reg ... (40 characters truncated) ...    revenue REAL,\n    FOREIGN KEY (product_id) REFERENCES products (product_id),\n    FOREIGN KEY (customer_id) REFERENCES customers (customer_id)\n)'),
 ('table', 'suppliers', 'suppliers', 6, 'CREATE TABLE suppliers (\n    supplier_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    supplier_name TEXT NOT NULL,\n    material_supplied TEXT NOT NULL,\n    contact_email TEXT\n)'),
 ('table', 'supply_chain', 'supply_chain', 7, 'CREATE TABLE supply_chain (\n    supply_chain_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    supplier_id INTEGER,\n    product_id INTEGER,\n    supply_da ... (24 characters truncated) ... upplied INTEGER,\n    FOREIGN KEY (supplier_id) REFERENCES suppliers (supplier_id),\n    FOREIGN KEY (product_id) REFERENCES products (product_id)\n)'),
 ('table', 'departments', 'departments', 8, 'CREATE TABLE departments (\n    department_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    department_name TEXT NOT NULL,\n    location TEXT\n)'),
 ('table', 'employees', 'employees', 9, 'CREATE TABLE employees (\n    employee_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    first_name TEXT NOT NULL,\n    last_name TEXT NOT NULL,\n    department_id INTEGER,\n    hire_date DATE,\n    salary REAL,\n    FOREIGN KEY (department_id) REFERENCES departments (department_id)\n)'),
 ('table', 'projects', 'projects', 10, 'CREATE TABLE projects (\n    project_id INTEGER PRIMARY KEY AUTOINCREMENT,\n    project_name TEXT NOT NULL,\n    department_id INTEGER,\n    start_date DATE,\n    end_date DATE,\n    budget REAL,\n    FOREIGN KEY (department_id) REFERENCES departments (department_id)\n)')]

In [28]:
%%sql

SELECT * FROM products;

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[(1, 'RTX 4090', 'GPU', '2023-01-15', 1599.99),
 (2, 'RTX 4080', 'GPU', '2022-11-16', 1199.99),
 (3, 'RTX 4070', 'GPU', '2023-03-08', 599.99),
 (4, 'Jetson Nano', 'AI Accelerator', '2022-05-20', 99.99),
 (5, 'Jetson AGX Orin', 'AI Accelerator', '2023-06-10', 1999.99),
 (6, 'DGX Station', 'Server', '2023-08-01', 8999.99),
 (7, 'A100 Tensor Core', 'AI Accelerator', '2021-07-15', 14999.99),
 (8, 'H100 Tensor Core', 'AI Accelerator', '2022-10-10', 19999.99),
 (9, 'GeForce GTX 1660', 'GPU', '2019-02-22', 279.99),
 (10, 'Titan V', 'GPU', '2017-12-07', 2999.99),
 (11, 'GeForce RTX 3060', 'GPU', '2021-10-01', 349.99),
 (12, 'GeForce GTX 1080', 'GPU', '2016-05-27', 499.99),
 (13, 'NVIDIA V100', 'AI Accelerator', '2017-06-10', 8000.0),
 (14, 'NVIDIA A40', 'AI Accelerator', '2020-09-15', 2500.0),
 (15, 'NVIDIA Quadro GV100', 'GPU', '2018-04-15', 8999.0)]

In [33]:
%%sql

SELECT product_name, price FROM products;

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[('RTX 4090', 1599.99),
 ('RTX 4080', 1199.99),
 ('RTX 4070', 599.99),
 ('Jetson Nano', 99.99),
 ('Jetson AGX Orin', 1999.99),
 ('DGX Station', 8999.99),
 ('A100 Tensor Core', 14999.99),
 ('H100 Tensor Core', 19999.99),
 ('GeForce GTX 1660', 279.99),
 ('Titan V', 2999.99),
 ('GeForce RTX 3060', 349.99),
 ('GeForce GTX 1080', 499.99),
 ('NVIDIA V100', 8000.0),
 ('NVIDIA A40', 2500.0),
 ('NVIDIA Quadro GV100', 8999.0)]

In [43]:
%%sql

SELECT product_name, category, price FROM products
WHERE price >= 1000;

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[('RTX 4090', 'GPU', 1599.99),
 ('RTX 4080', 'GPU', 1199.99),
 ('Jetson AGX Orin', 'AI Accelerator', 1999.99),
 ('DGX Station', 'Server', 8999.99),
 ('A100 Tensor Core', 'AI Accelerator', 14999.99),
 ('H100 Tensor Core', 'AI Accelerator', 19999.99),
 ('Titan V', 'GPU', 2999.99),
 ('NVIDIA V100', 'AI Accelerator', 8000.0),
 ('NVIDIA A40', 'AI Accelerator', 2500.0),
 ('NVIDIA Quadro GV100', 'GPU', 8999.0)]

In [45]:
%%sql

SELECT product_name, category FROM products
WHERE category = 'AI Accelerator';

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[('Jetson Nano', 'AI Accelerator'),
 ('Jetson AGX Orin', 'AI Accelerator'),
 ('A100 Tensor Core', 'AI Accelerator'),
 ('H100 Tensor Core', 'AI Accelerator'),
 ('NVIDIA V100', 'AI Accelerator'),
 ('NVIDIA A40', 'AI Accelerator')]

In [47]:
%%sql

SELECT product_name, category, price FROM products
WHERE product_name LIKE '%Quadro%';

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[('NVIDIA Quadro GV100', 'GPU', 8999.0)]

In [12]:
%%sql
SELECT * FROM sqlite_sequence

 * sqlite:///D:/GitHub/nvidia-project/nvidia_database.db
Done.

[('products', 15),
 ('customers', 20),
 ('sales', 100),
 ('suppliers', 50),
 ('supply_chain', 100),
 ('departments', 5),
 ('employees', 30),
 ('projects', 10)]